/**
 * 模拟图表数据
 */
export default ({ fetchMock, delay, mock, toSuccess, toError }) => {
  return {
    '/api/charts/bar1': options => {
      return toSuccess(
        mock([
          { year: '1951 年', "sales|1-100": 100 },
          { year: '1952 年', "sales|1-100": 100 },
          { year: '1956 年', "sales|1-100": 100 },
          { year: '1957 年', "sales|1-100": 100 },
          { year: '1958 年', "sales|1-100": 100 },
        ]),
        400
      );
    },
    '/api/charts/bar2': options => {
      return toSuccess(
        mock([
          { name:'London', '一月.|1-100': 1, '二月.|1-100': 1, '三月.|1-100' : 1, '四月.|1-100': 1, '五月.|1-100': 1, '六月.|1-100': 1, '七月.|1-100': 1, '八月.|1-100': 1,'九月.|1-100': 1, '十月.|1-100': 1, '十一月.|1-100': 1, '十二月.|1-100': 1  },
          { name:'Berlin', '一月.|1-100': 1, '二月.|1-100': 1, '三月.|1-100' : 1, '四月.|1-100': 1, '五月.|1-100': 1, '六月.|1-100': 1, '七月.|1-100': 1, '八月.|1-100': 1,'九月.|1-100': 1, '十月.|1-100': 1, '十一月.|1-100': 1, '十二月.|1-100': 1  }
        ]),
        400
      );
    }
  };
};
